УправлениеСдачейКвартир/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеСдачейКвартир/src/Enums/ВидДоговора/ВидДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДоговора</name>
  <enumValues>
    <name>САрендодателем</name>
  </enumValues>
  <enumValues>
    <name>САрендатором</name>
  </enumValues>
</mdclass:Enum>

УправлениеСдачейКвартир/src/Catalogs/Договоры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ДатаЗаключения = ТекущаяДатаСеанса();
	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОтправитьВМобильноеПриложение();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьВМобильноеПриложение()

	Если ВидДоговора <> Перечисления.ВидДоговора.САрендатором Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	|ГДЕ
	|	НЕ ОбменСМобильнымПриложением.ПометкаУдаления
	|	И НЕ ОбменСМобильнымПриложением.ЭтотУзел";

	Выборка = Запрос.Выполнить().Выбрать();

	УзлыДляРегистрации = Новый Массив;
	Пока Выборка.Следующий() Цикл

		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		УзлыДляРегистрации.Добавить(Выборка.Ссылка);

	КонецЦикла;

	Если ЗначениеЗаполнено(УзлыДляРегистрации) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыДляРегистрации, Владелец);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
